as 28942
recreational 4
golfer 4
with 29035
some 10919
knowledge 199
of 96008
the 224195
sports 138
history 781
was 33972
pleased 65
disneys 28
sensitivity 24
to 90957
issues 297
class 481
in 61278
golf 66
early 958
twentieth 22
century 325
movie 31299
depicted 115
well 6063
psychological 139
battles 73
that 46372
harry 189
vardon 15
fought 58
within 521
himself 1265
from 13540
his 17497
childhood 149
trauma 32
being 4421
evicted 4
own 1959
inability 45
break 357
glass 93
ceiling 41
prevents 21
him 5578
accepted 103
an 14274
equal 76
english 611
society 387
likewise 47
young 2030
ouimet 8
goes 1616
through 3235
struggles 93
mere 107
caddie 2
eyes 774
upper 61
crust 8
americans 214
who 13060
scoff 7
at 16153
attempts 441
rise 144
above 543
standing 157
br 69460
what 10516
loved 771
best 3520
however 2344
is 69197
how 6072
this 53095
theme 456
manifested 5
characters 5212
ouimets 6
parents 515
father 976
workingclass 10
drone 12
sees 317
value 389
hard 1670
work 2721
but 27739
intimidated 5
by 14421
mother 891
recognizes 13
her 10494
sons 94
talent 719
and 104807
desire 135
encourages 24
pursue 28
dream 302
competing 26
against 873
those 3076
think 4842
he 16388
inferior 61
finally 970
scenes 3668
are 19866
photographed 72
although 1510
course 1553
used 1360
not 20996
actual 500
site 161
historical 286
tournament 17
little 4012
liberties 38
taken 668
disney 285
do 6568
detract 29
beauty 329
film 25051
theres 2349
one 17479
moment 661
pool 91
table 170
otherwise 504
viewer 745
does 3810
really 8056
ending 1611
miracle 44
creation 108
only 8289
human 922
could 5613
have 19805
written 956
saw 2079
sneak 48
preview 75
it 52836
delightful 89
cinematography 614
unusually 24
creative 221
acting 4819
good 9739
story 7124
fabulous 65
if 12425
wont 932
be 18627
because 6243
doesnt 3199
deserve 234
before 2819
didnt 3415
realize 361
charming 199
shia 8
marvelous 61
selfcontained 6
job 1329
lead 946
something 3617
incredibly 473
sweet 245
about 11739
makes 2647
even 9205
better 4212
other 6046
actors 3224
contains 259
moments 1009
high 1345
suspense 551
more 9157
than 6550
might 2115
expect 791
movies 5632
dime 19
dozen 113
stands 243
out 11619
id 948
recommend 1073
anyone 1877
bill 366
paxton 34
has 10627
true 1282
us 2337
open 440
made 5309
much 6584
extraordinary 103
game 922
also 5542
deals 148
directly 129
tensions 23
touches 93
upon 619
profound 85
anticatholic 2
prejudices 21
both 2024
british 520
american 1390
establishments 6
heart 647
perennial 10
favourite 144
triumph 42
odds 65
exemplary 9
throughout 862
stephen 181
dillane 5
excellent 944
usual 557
revelation 91
laboeuf 2
delivers 203
disciplined 4
dignified 11
highly 604
sympathetic 147
performance 1542
working 498
kid 772
fighting 377
way 5118
new 2365
england 142
wasp 10
establishment 26
for 29102
familiar 321
slapstick 163
performances 970
stevens 68
demonstration 18
maturity 19
surprise 454
josh 84
flitter 4
ten 582
year 1136
old 2549
caddy 8
threatens 43
steal 186
every 2731
scene 3857
which 7602
appears 586
fashioned 43
sense 1572
word 661
fine 752
clear 569
directing 392
great 5083
grips 18
end 3677
final 873
affectionate 8
nod 43
casablanca 16
just 12900
many 4307
pleasures 30
fill 171
on 22927
september 20
indianapolis 2
am 2088
judges 48
heartland 4
festival 222
screens 49
films 5049
their 7413
truly 1087
moving 460
picture 919
award 228
explores 39
journey 237
artistically 18
expressing 22
hope 941
respect 307
positive 339
values 327
life 3499
gave 828
part 2597
time 8098
rich 403
gentlemen 43
people 6044
participate 29
country 569
clubs 38
backdrop 80
unfolds 54
boy 954
takes 1301
greatest 425
world 2034
inspirational 28
all 15424
francis 64
played 1641
labeouf 3
holes 315
gets 2138
compete 35
golfers 6
britain 70
illprepared 4
child 656
hilarious 609
motivational 5
steals 130
despite 865
these 3695
handicaps 4
displays 72
courage 80
spirit 260
heroism 17
humility 7
event 206
we 6256
learn 439
lot 2768
years 2554
example 962
use 1201
small 978
wooden 283
layout 9
short 1252
manual 14
scoreboard 6
swinging 34
pipes 13
mouths 44
terrible 1552
conditions 59
greens 13
play 1414
canceled 42
torrential 4
rain 83
stunning 200
art 667
direction 956
editing 554
no 9321
big 2332
stars 973
somehow 523
believable 440
adds 224
inventory 6
vein 49
remember 1049
titans 12
fyi 7
there 11061
pictures 271
web 73
where 4271
listing 20
past 734
winners 25
going 2964
back 3054
night 1295
hunted 35
french 556
porn 253
star 1191
brigitte 25
cast 2291
members 391
slowmoving 22
production 1239
were 7903
its 16213
frantic 34
certainly 935
different 1372
rollins 6
lesbian 158
vampire 344
memorable 354
lips 77
blood 773
or 12576
plays 1309
amnesiac 8
hitchhiker 20
cant 2821
she 7509
came 1120
place 1562
modern 494
apartment 171
lahaie 3
held 202
kind 1946
medical 126
group 814
thats 2731
treating 25
number 644
similar 478
escapes 107
monolithic 3
office 327
tower 30
affected 64
highway 29
outside 392
meets 347
stops 101
picks 99
offers 199
plenty 382
pace 353
extremely 725
slowthe 4
atmosphere 402
horribly 200
sad 672
relationship 561
between 2046
another 2944
asylum 55
inmate 13
dominique 17
too 5278
dull 690
completely 1510
look 2954
you 21091
fan 1329
jean 154
seen 4543
they 15111
mostly 633
seem 1475
bloody 218
naked 306
women 1195
fests 5
like 14151
sort 1077
thing 3494
bad 7822
major 625
departure 23
almost 2106
cronenberg 27
minus 54
biomechanical 2
nightmarish 18
stuff 863
except 812
subtitles 136
man 3281
driving 204
road 327
comes 1539
across 686
woman 1636
bathrobe 4
up 8450
while 3361
background 429
yet 1748
lingers 17
wearing 271
nothing 3292
drive 215
along 1302
obvious 744
right 2106
forgets 30
things 2535
quickly 458
happen 721
still 3311
though 2778
prevent 78
having 1627
sex 1239
once 1472
return 333
paris 208
leaves 432
strangers 53
show 4163
take 2359
away 1895
block 62
huge 690
building 301
referred 57
black 1328
others 1007
whom 380
memory 195
seems 2523
least 2344
problems 587
reason 1715
events 512
march 55
involve 77
trying 1836
find 2687
whats 680
get 6481
manage 204
call 683
robert 650
guy 2389
picked 234
first 5619
come 2118
rescue 169
last 1819
few 2779
rather 1759
strange 594
touching 186
avoiding 36
seemed 1024
typical 475
formula 145
rollin 7
created 355
feel 1885
most 5583
fascinating 200
disturbing 285
check 498
since 1885
cartoon 357
days 862
felix 28
talks 181
using 545
bubbles 13
animation 387
style 897
very 8774
crude 111
when 9311
compared 344
today 529
contemporaries 12
pretty 2677
holds 173
age 545
funny 3031
whose 578
shoe 39
business 406
folding 6
sell 166
any 5517
shoes 90
needs 527
money 1697
so 14175
can 7291
go 3286
hollywood 1103
tells 494
shop 187
hell 848
sold 94
spreads 14
chewing 29
gum 17
over 3613
town 783
soon 701
stuck 260
leave 696
buy 493
ones 771
store 401
gratitude 4
gives 885
owner 156
wants 828
alone 585
figures 117
barges 5
into 6113
studio 319
bit 1917
nuisance 9
versions 99
comics 64
ben 189
turpin 9
charlie 248
chaplin 128
luck 157
discovered 159
offered 105
contract 52
hurray 5
title 1045
unlike 331
stories 595
love 3671
war 1163
isnt 2362
sticky 16
pink 98
rose 110
thorns 4
four 612
leading 391
set 1450
realistic 427
balance 84
tragic 182
downtoearth 11
music 2078
lyrics 65
songs 460
sung 50
keira 22
knightley 15
herself 443
drag 184
deeper 111
brutal 155
amongst 104
peaceful 21
may 2033
biopic 55
romantic 436
consequently 34
follows 309
dylan 45
thomas 203
triangular 3
steeped 5
joy 156
jealousy 43
london 222
visualized 5
angle 107
bohemian 11
during 1409
bombings 3
germans 111
floating 69
bedrooms 8
pubs 4
bars 55
independent 188
soldier 187
charismatic 60
poet 22
constantly 300
swept 30
feelings 226
anger 105
maybe 1734
twisted 145
hangs 39
somewhat 573
loosely 103
rest 1268
version 1292
viewed 132
restored 26
sometimes 674
problem 1048
silent 251
era 297
animated 211
hollywoods 53
famous 412
making 1710
cameo 148
appearances 96
must 2093
enthusiast 20
proof 110
chaplins 53
sound 1067
color 220
requirements 7
quality 876
fact 2364
uses 343
started 677
gags 209
devices 50
became 431
standard 297
later 1319
caricatures 37
celebrities 25
including 650
aforementioned 89
speak 390
balloons 9
given 1227
newspapers 23
comic 445
strip 81
device 123
natural 224
harmonious 7
adding 117
dimension 58
literally 324
figuratively 7
delight 78
watch 4905
worth 1582
taking 609
effort 576
recommended 281
say 3866
whether 545
larry 171
hama 2
ever 4223
cartoons 124
would 8641
writing 908
said 1484
file 30
cards 79
count 250
fans 875
continuation 19
same 2761
insane 177
cobra 75
commander 54
favorites 102
personal 369
note 437
always 1871
irritated 30
me 7442
duke 77
charge 114
tons 84
officers 87
around 2478
instead 1669
battle 432
sequences 485
series 1861
main 1639
trick 83
here 3544
cgi 276
overall 952
overthetop 133
errol 43
flynns 19
roguish 5
charm 211
shines 72
entertaining 923
exciting 302
historically 78
bankrupt 13
infamous 82
general 456
custer 73
career 619
day 1511
west 238
point 2148
civil 98
horn 30
butting 2
heads 211
rival 85
arthur 116
kennedy 98
romancing 8
olivia 58
de 354
havilland 21
flynn 77
flamboyant 22
basically 683
playing 1053
lavish 22
should 3464
been 6457
technicolor 25
directed 747
raoul 12
walsh 22
died 341
boots 55
features 415
wellstaged 2
real 2984
treat 154
see 7516
anthony 150
quinn 67
crazy 379
horse 190
previous 415
jeb 4
stuart 51
opposite 204
ronald 55
reagans 4
george 512
santa 46
fe 6
trail 77
actionpacked 13
warner 83
brothers 319
designed 112
make 5633
fail 188
tampered 6
considerably 40
director 2669
walshs 3
firstrate 22
western 413
inaccurate 67
wholly 44
exhilarating 9
biography 51
cavalry 22
officer 182
armstrong 42
chronicles 30
arrives 125
academy 162
until 1091
indians 101
massacre 164
signature 17
roles 600
epics 15
teamed 23
quite 2276
often 937
afterward 49
reunited 12
interest 651
appeared 252
couple 1226
seven 207
white 822
oater 6
brilliant 640
dynamic 58
action 2041
humorous 147
stern 25
dramatic 354
confrontations 13
our 1549
hero 656
adversaries 14
notorious 69
errors 92
involves 164
colonel 64
philip 68
sheridan 13
shown 682
commandant 5
indeed 441
lieutenant 31
lee 364
earlier 385
showed 277
lapse 16
concerns 95
whitfield 6
scott 273
union 117
troops 49
presented 240
drinker 3
probably 1966
had 7760
reputation 123
drinking 118
neither 397
drank 12
nor 468
smoked 12
nevertheless 103
goofs 27
splendid 43
opens 157
riding 90
military 280
fancy 77
dress 122
uniform 25
africanamerican 32
carrying 108
luggage 8
tending 6
dogs 188
after 4939
sergeant 37
guard 99
realizes 102
turned 664
honor 92
future 499
highranking 6
foreign 179
turns 773
ranking 15
cadet 4
ned 26
sharp 132
city 661
conquest 9
practical 43
installing 5
quarters 32
romulus 3
taipe 7
stanley 43
ridges 2
task 117
force 328
promptly 24
runs 284
naturally 180
volatile 12
attacks 117
public 361
brawl 12
phil 45
john 1213
litel 3
katie 27
elder 29
prepared 138
dismiss 15
conduct 24
unbecoming 3
cannot 678
enrolled 4
enrolls 3
establishes 18
mediocre 283
academic 25
fight 763
accumulate 4
galore 22
erupts 9
graduates 13
cadets 6
completed 63
education 61
rushes 19
them 5555
combat 75
hustled 3
off 4122
avid 50
encounters 71
wife 1108
elizabeth 128
libby 12
bacon 28
pledge 8
themselves 757
each 1619
mr 882
gene 94
lockhart 2
carousel 5
detests 4
sight 199
ran 169
saloon 18
insulted 42
custers 14
friends 1279
reprimanded 2
meanwhile 163
washington 98
desperately 109
seeks 52
transfer 50
regiment 6
cooling 5
heels 30
befriends 35
rotund 4
winfield 3
sidney 58
greenstreet 11
maltese 5
falcon 30
share 196
appetite 15
creamed 2
bermuda 11
onions 4
becomes 820
characteristics 32
assigns 4
second 1173
command 53
bull 63
run 862
july 45
disobeys 4
orders 69
none 712
strikes 63
superior 203
bridge 91
infantry 8
cross 176
wounded 62
shoulder 51
sent 259
hospital 244
receives 55
medal 12
confederate 22
army 281
pennsylvania 18
shocked 166
chance 639
south 260
brigadier 3
found 1698
goads 3
promoting 27
available 268
mistake 263
promoted 37
incredulous 11
embraces 17
cracks 33
advance 70
idles 2
down 2453
starts 775
boozing 6
boys 515
local 616
shows 1519
crooked 39
railroad 38
promoter 7
try 1250
enlist 12
serve 118
president 180
railway 13
obtain 20
funds 27
eventually 436
intercedes 2
behalf 20
active 44
duty 77
finds 530
drunken 72
surprised 501
commands 16
liquor 15
fort 36
guns 190
navarone 4
custody 27
adversary 10
government 272
agent 254
conspire 11
destroy 183
peace 113
treaty 7
sioux 7
indian 270
nations 45
brought 427
charges 28
striking 72
discovers 133
drummed 6
gold 218
strike 67
sacred 20
hills 82
settlers 18
rampage 37
hit 619
warpath 5
sacrifices 25
men 1180
slambang 3
showdown 45
redskins 2
stagecoach 20
bert 18
glennon 2
captures 74
grit 18
glory 86
long 2119
shot 1413
leaving 293
dawn 104
spectacular 143
added 297
premonition 5
imminent 14
demise 48
faints 2
benefits 31
topnotch 29
max 186
steiner 10
score 668
incorporates 16
tune 108
gary 136
owen 79
keep 1049
rigid 14
perspective 117
actually 3247
got 2436
adventure 250
romance 378
premiere 67
casting 333
evident 74
board 230
pass 302
muster 21
purists 11
hundred 106
percent 28
accuracy 49
telling 342
beyond 725
need 1214
put 1690
aside 331
book 1694
enjoy 1116
fiction 312
know 4452
consider 308
stand 430
prominence 6
post 168
america 376
guess 1106
unresolved 31
quandary 4
matter 882
two 4313
hour 825
plus 461
arrival 55
head 1062
full 1127
regalia 2
joke 491
putting 263
majors 10
headquarters 14
gotten 178
trouble 338
ironically 78
comedy 2065
meeting 146
subsequent 66
include 256
tea 71
reader 57
callie 2
hattie 7
mcdaniel 4
hadnt 197
noticed 199
reminded 206
awful 1566
favorite 621
character 4475
actor 1446
mine 204
forties 19
mantan 11
moreland 11
looked 850
hamming 13
mind 1183
owl 13
hoot 48
interesting 2184
portrayed 378
depiction 114
vying 9
attention 565
reagan 36
arrogance 22
flamboyance 4
remembers 40
portrayal 306
close 691
richard 403
lets 713
top 1017
manner 225
persevered 2
maintain 71
name 1161
gamble 16
risky 17
venture 56
loyalty 30
led 208
discipline 20
developed 242
poignant 67
confrontation 52
arch 13
declared 23
entirely 358
dependent 27
view 558
remark 25
insight 113
stated 75
your 4168
blame 250
birth 93
nation 60
myself 835
longrunning 5
tradition 84
travesties 6
greater 101
examples 121
apart 418
getting 1218
names 317
grant 82
spelt 7
geography 7
correct 165
wiped 17
hyperbole 5
invention 43
ludicrous 141
limits 68
throw 294
downright 123
hackneyed 60
purest 8
exposition 62
wifes 48
learning 103
phony 65
rush 89
excuse 334
invasion 60
territory 82
testimony 13
front 430
congress 15
pleading 5
rights 121
red 412
storming 4
presidents 25
beg 38
honestly 381
comical 116
corniness 6
actioner 20
dashing 16
dehavilland 4
beguiling 10
start 1211
crowd 175
tumultuous 6
ford 167
taught 54
liberty 27
valance 2
believe 1857
legend 142
truth 408
closer 101
hey 321
rollicking 4
wonderfully 132
enjoyable 447
classic 973
entertainment 516
purposes 67
reliable 37
looking 1740
thinking 833
yourself 671
oh 1178
want 2605
rent 573
enjoyment 83
older 352
fun 1712
everyone 1415
loves 247
personality 213
allows 109
everything 1677
ends 597
marriage 165
portrays 122
arrogant 79
suave 18
cute 371
especially 1490
flirting 13
meet 427
chemistry 274
screen 1594
impressive 274
comedic 182
role 1887
stereotypical 162
will 5698
definitely 904
laugh 1128
heroic 88
excitement 133
beautiful 1116
costumes 266
tone 232
script 2288
times 2054
corny 172
directors 602
debatable 8
hate 602
give 2413
thumbs 71
dies 264
help 1187
sure 1771
werent 366
consulted 5
decision 154
looks 1659
acts 276
cavalier 7
garry 13
nice 1214
hear 476
robin 190
hood 91
tape 206
confederates 6
crooks 24
singlehanded 2
forget 469
lady 437
mary 210
never 4512
link 63
facts 167
persons 75
nobody 339
claimed 54
documentaries 72
awesome 252
partnership 12
genuine 170
im 3472
flick 937
captivating 44
now 3046
ago 624
underrated 119
genius 302
sweeping 38
broad 78
intimate 48
tears 161
easy 490
heartwrenching 8
deep 461
christian 220
message 493
implicit 6
faith 145
trust 194
fidelity 7
extent 112
letting 112
order 656
moral 205
protect 94
innocent 229
civilians 33
certain 551
mustsee 48
defining 18
inside 410
patriotic 38
reasons 427
knew 618
confirms 20
my 8378
suspicions 18
among 476
known 631
inept 134
death 1230
paints 33
mistakes 121
misdeeds 2
ue 2
confident 32
recruit 25
distinguishes 4
poor 1664
student 262
bother 430
confuse 50
genuinely 161
such 3301
predicaments 7
spite 111
united 143
states 204
error 42
promotion 22
rank 64
corrected 8
leads 451
campaign 58
successful 313
unlikely 113
national 167
returns 212
hometown 23
marries 36
sweetheart 23
supportive 25
understanding 196
steadfastly 2
stays 94
side 787
frontier 30
assumes 43
leadership 9
seventh 19
strives 13
native 180
prove 174
intentions 95
enters 74
leader 210
jeopardized 4
conspiracy 82
spread 54
false 134
rumor 11
lives 737
under 805
slaughter 38
thousands 122
dominates 13
successfully 73
depending 36
mood 276
havillands 2
tender 44
gentle 54
acted 411
together 1421
several 946
smooth 38
parts 789
portrayals 47
enhance 23
edward 127
reviewer 153
rate 337
accurate 184
appeals 35
large 386
variety 141
audiences 299
largely 124
based 894
likes 336
guys 1217
wanting 205
land 294
brings 328
flair 52
drama 760
flawed 115
jovial 5
essays 6
reckless 28
headstrong 9
extraordinarily 22
generous 87
partisan 10
interpretation 87
fighter 77
blunder 13
excused 9
sacrifice 53
exposing 18
corruption 50
officials 29
traders 4
protest 22
unfair 58
treatment 144
plains 19
costar 48
scores 66
devoted 76
adoring 7
fierce 20
chief 122
brief 259
vignettes 34
seemingly 233
supported 45
handful 92
troopers 37
hammers 9
submission 19
grand 162
spectacle 44
savage 80
clash 22
quarter 37
wild 252
mix 225
determined 105
wonderful 763
spunky 11
energy 204
nikki 29
ruins 103
perfect 776
yuppie 7
corrupts 3
ways 436
york 343
exactly 692
domain 37
madonnas 15
animals 200
running 684
rampant 21
hideous 70
bald 32
chasing 102
causing 95
havoc 40
adult 262
woven 28
antics 74
ms 217
finn 5
anywhere 222
indoor 10
atrium 2
pure 349
nicole 91
madonna 50
released 624
prison 280
ordered 47
bus 121
philadelphia 31
stick 341
arrested 75
claims 130
information 243
record 176
louden 3
griffin 23
dunne 51
assigned 52
escort 13
law 250
anyway 823
laws 47
rolls 46
royce 7
picking 79
wedding 127
ring 179
rare 209
cat 289
eccentric 71
collector 31
ensuing 9
mayhem 56
jumps 96
cats 77
taxi 48
drivers 39
bridesmaids 3
cake 59
lawyer 83
knows 597
hes 1980
kansas 24
anymore 263
madness 101
trip 239
avenue 23
foils 9
connection 189
uproarious 7
excon 10
uptight 26
respectively 34
laudable 6
ability 287
send 151
fits 120
hysteria 19
implausible 98
next 1257
secondary 66
supporting 418
scenery 288
someone 1653
jolt 5
pronto 2
usually 682
seek 112
genre 742
move 546
then 5712
meant 410
thoughts 130
cranium 2
ponder 28
saying 765
whos 448
girl 1711
nonetheless 99
campy 138
barely 377
boring 1607
ive 2292
watched 1551
younger 336
crush 53
wasnt 1681
male 450
heartthrob 9
morris 42
late 679
austrian 12
actress 714
bibi 7
tv 1880
special 1544
jon 76
highlight 114
counting 31
rearranging 3
sock 27
drawer 9
content 249
forever 253
garfield 73
self 255
interested 411
loner 20
friend 964
failed 369
cringeworthy 26
dance 402
rivals 37
david 604
fusion 6
flashdance 16
mc 11
hammer 90
discos 2
dead 1224
says 779
jerk 101
worried 79
prefer 120
kids 1309
fortunately 105
girlfriend 395
allergic 9
slicker 9
specials 23
feels 465
longer 334
episode 925
funniest 201
musical 418
rentingbuying 4
taste 293
smile 166
watching 3350
definite 74
cheese 136
throwaway 16
oneliners 77
theft 31
thanks 265
awardworthy 2
razzies 5
oscars 54
curious 140
received 137
regular 166
influenced 68
speaking 263
voice 648
accent 364
motorcycle 60
cops 316
news 247
buck 78
ups 83
delivery 107
critics 246
alike 54
praised 26
enjoyed 658
beginning 928
timeless 49
piece 1099
aged 89
mrs 192
ritchies 6
planet 252
unique 324
showcases 20
timing 113
exconvict 6
framed 36
crime 431
commit 80
hapless 40
station 220
unfortunate 126
occurs 75
thus 275
creating 183
plot 4828
folks 284
pleasantly 53
cares 167
damn 232
alanis 4
rocks 73
theatres 40
thought 2372
dubbed 156
alltime 58
screams 80
falls 542
interview 129
lifts 15
fools 60
whole 2276
enough 2518
floor 203
rob 126
cashier 5
busted 18
tapes 40
difference 230
dont 6373
why 3999
slammed 3
did 4518
wrong 1352
youre 1390
whatever 492
important 577
exist 159
rock 427
ya 79
superb 300
opened 105
nyc 38
cultural 90
icon 42
hits 164
seeking 91
susan 97
tickets 40
concert 99
giants 27
stadium 23
variation 41
routine 134
witness 114
shenanigans 24
named 513
murray 86
bridetobe 3
slept 37
cabbie 11
mean 1253
fatherinlaw 9
key 186
car 814
chases 99
trailing 10
path 98
elements 444
screwball 47
intact 29
sir 131
mills 28
briefly 104
shares 46
champagne 12
complete 805
forest 139
able 876
tolerate 32
fantastic 353
ps 108
lousy 202
sheer 174
finish 283
tension 330
loosing 13
teaming 14
walken 51
bracco 7
works 720
perfection 59
echo 23
sexy 289
scam 25
artist 151
fights 183
independence 40
weirdest 19
haircut 21
imagine 556
parody 186
burt 71
lancaster 15
elmer 25
pleasure 173
miguel 14
ferrer 12
underappreciated 13
generation 190
pimp 48
jamaican 18
thugs 55
behold 38
tale 412
thieves 49
lovehate 9
type 720
rogue 28
bigger 177
finding 261
sandwiched 5
stale 64
prequel 30
rehashed 15
upn 3
affiliates 6
midday 3
saturday 141
program 155
misleading 60
deserves 357
talented 364
attributes 17
maximum 39
advantage 89
team 557
provide 222
perhaps 1068
predictable 683
streetwise 11
troubled 90
minds 121
portraying 135
ride 280
roller 27
coaster 21
la 381
training 112
dive 42
adolescent 37
fantasy 314
technical 170
details 266
sole 88
criteria 15
culture 260
poorer 10
godfather 88
wave 71
mozart 17
california 135
beaches 18
battlestar 13
baywatch 12
playboy 45
centerfold 2
video 1149
waynes 45
reasonable 99
albeit 95
storyline 571
keeps 372
eye 427
candy 156
graces 21
joe 351
estevez 49
bringing 148
focus 304
eternally 9
uncle 149
bud 37
expected 462
absurdities 13
female 693
band 292
without 2172
guitars 12
plugged 8
intentional 49
attracted 100
box 515
regret 123
promised 56
nonviolent 5
erotic 108
twice 239
cinemax 28
unrated 25
softcore 70
trimmed 14
cut 699
nudity 383
beach 205
tremendous 71
fritz 38
dude 180
bottle 79
oil 74
pun 66
intended 307
unfortunately 1014
chopped 46
rated 242
siblings 36
stallone 34
sheen 88
travolta 80
etc 843
act 876
linnea 39
quigley 38
ward 49
batman 160
doctors 99
room 609
escorted 4
seat 149
doctor 448
asks 174
questions 299
silence 109
continues 146
ask 416
ignoring 33
girls 885
traumatised 2
home 1082
spending 91
mental 165
incident 97
happened 713
hand 648
greeted 10
stepmother 30
obviously 908
hold 353
resentment 8
evil 866
torment 21
vengeful 24
ghost 271
far 2116
helping 97
recovery 12
amazing 591
twist 371
heartwarming 48
cry 229
points 484
teary 4
specifically 71
cupboard 10
total 507
feeling 682
dread 29
rolling 118
credits 494
soundtrack 522
faultless 7
furnishings 4
house 1225
colour 66
asian 182
fanatics 17
sisters 160
creepiest 11
recently 329
supernatural 153
element 207
returning 84
fathers 128
absence 66
revealed 176
stay 579
institution 23
forced 501
deal 496
schizophrenic 24
possibly 459
bipolar 11
lashes 3
cheerfully 9
shes 904
dinner 104
presence 274
unexplained 52
sister 438
exists 103
unable 160
save 861
callous 9
let 1199
die 581
specifics 11
family 1539
creepy 370
nagging 15
hint 100
confusion 94
light 517
viewing 441
youve 553
placed 131
horror 2441
lies 245
sudden 140
shocks 41
helpings 3
guts 83
gore 717
piques 3
viewers 518
curiosity 99
builds 70
suspenseful 108
aura 21
mystery 443
answer 235
pushing 60
analyse 5
took 787
slow 678
begins 390
jumping 95
immediately 314
conventional 64
orchestral 16
stings 3
scared 197
particular 422
slowly 258
terror 166
unknown 196
fear 289
evade 11
explanation 242
conclusion 307
heavyhanded 39
entire 1014
fall 522
neatly 26
requires 85
reflect 59
square 60
frightening 115
joys 20
conspicuous 4
scares 117
gutwrenching 11
defies 32
convention 38
expands 9
proportions 31
hitherto 5
unexplored 7
traditional 104
exaggeration 19
socalled 111
align 4
ringu 19
grudge 96
understood 104
requiring 12
suspension 53
credulity 7
embracing 12
wholeheartedly 14
whichever 7
choose 171
interpret 18
demands 84
openminded 15
approach 201
rewarding 26
regardless 120
preconceived 6
notions 14
cinema 883
football 181
cars 161
opportunity 239
weekend 114
laughed 267
till 132
cried 69
uk 131
denmark 21
commercial 179
telephone 48
company 375
earth 529
humour 314
applaud 29
done 2051
finest 112
commentators 22
suggest 257
lengthened 2
due 578
density 2
irony 89
comment 440
merit 98
noonan 8
carries 102
thankless 20
perfectly 322
preferred 49
narrator 60
less 1189
recognizable 37
gravitas 11
lent 8
pitch 62
read 1305
bar 245
recognize 129
living 596
celebrates 10
stupidity 151
banality 17
forge 4
contrary 70
bitter 99
defenders 7
picasso 5
reference 112
believed 130
whore 42
assume 179
drawings 26
finer 20
artists 99
become 895
lifetime 115
presently 11
bought 311
dvd 1439
initially 104
janghwa 2
hongryeon 2
intriguing 192
confused 265
imdb 515
titled 73
masterpiece 375
answered 36
faster 67
load 97
opiemar 4
impressed 193
explanations 34
user 66
provided 169
missed 350
congratulate 8
write 501
summary 146
guide 110
agree 382
korean 51
vote 202
afford 78
support 220
understand 1128
intend 30
again 2547
near 527
eight 117
brazil 73
medo 2
sumi 16
soojung 2
suyeon 10
moon 215
kim 105
eunjoo 7
welcomes 5
hates 57
seeing 1383
attitude 178
coldly 8
grows 86
tense 89
called 992
mysterious 245
occur 78
hanging 127
wardrobe 58
already 936
hung 46
dresses 61
design 188
diary 27
sleeping 125
bed 306
nightmare 120
awakes 9
dangles 2
womans 93
skirt 15
evening 116
brother 587
visit 146
met 179
talk 630
annoyed 103
anything 2152
listening 121
panic 39
conflict 166
worst 2448
pulls 109
locks 22
saves 105
complains 28
daughter 713
response 80
unexpected 116
angrily 8
please 754
tired 290
following 405
words 641
mouth 220
shocking 235
tell 1186
seated 12
theater 506
intuition 6
told 666
regretting 9
showing 544
changed 315
expectation 41
minutes 2411
painful 343
horrible 1190
sensational 31
core 167
disappointed 668
fell 275
dark 885
brooding 25
teenage 218
coping 15
strained 33
appearing 106
increasingly 88
becoming 206
unstable 23
slants 2
oriental 18
effects 1817
unsettling 48
aspect 269
eeriness 6
jump 168
clearly 612
original 2165
simply 1376
influential 28
makers 305
decade 142
opinion 581
scare 149
strong 536
entry 116
korea 28
arent 638
offkilter 8
foreboding 18
awkward 176
interactions 39
conceptual 4
everyones 81
fears 63
case 1061
closet 73
sink 55
liked 900
capture 166
dysfunctional 36
household 44
revealing 83
peoples 159
inner 100
fragility 3
simple 588
wiping 8
makeup 319
mirror 99
sitting 336
flickering 11
mainly 243
exploration 43
guilt 66
consequences 94
spoilers 393
ahead 233
further 327
twists 292
bag 121
dragging 29
flashback 135
tied 87
machinist 7
joint 25
breakdowns 4
delusions 16
heres 186
supposed 1159
either 1400
delusion 15
interact 31
initial 111
gray 71
talking 637
phone 248
appear 415
pick 322
imagined 56
split 78
explains 126
bizarre 328
party 417
sequence 550
recounts 7
ghosts 106
green 259
hairpin 3
hair 370
dining 13
punished 29
ties 59
terms 262
responsible 204
unintentionally 108
wonder 778
killed 935
left 1453
ambiguous 36
suggested 68
explained 207
nurse 168
care 1036
contributed 33
began 206
caused 137
kill 935
alludes 7
physically 91
accept 200
suggestion 39
incest 49
sleeps 28
freaks 55
shouts 20
touch 259
reaches 64
filthy 39
conversation 137
capacity 26
interpretations 20
derivative 60
crawling 26
herkyjerky 3
movements 63
kayako 5
desserts 11
reminiscent 82
furthermore 86
idea 1563
sixth 40
remake 428
honest 317
snooty 8
types 154
insist 39
remakes 40
excited 161
water 442
coming 716
summer 212
havent 521
japanese 348
list 379
review 635
overdue 4
single 596
ill 816
gem 176
screenplay 426
postproduction 12
filmmaking 229
practically 125
sea 241
faux 19
masterpieces 44
structure 113
easily 485
tightly 20
constructed 79
vitally 2
minute 484
jiwoon 4
taunts 4
dissect 6
detailed 80
levels 157
insignificant 18
object 104
rack 22
diaries 10
drop 150
emanating 3
crack 86
pills 20
meticulous 7
inspection 6
clue 157
helps 209
contributes 22
stirring 17
reflection 68
concepts 56
lurk 6
intelligence 207
prompts 10
spring 44
forefront 8
rapidfire 8
relentless 30
fashion 217
perpetual 9
state 367
lest 22
miss 549
level 590
highest 64
superlative 12
form 435
imaginable 47
commonly 16
cited 7
criticism 122
nicely 160
summarized 12
zaphod 5
goode 2
falsely 12
incoherent 100
mess 535
instill 7
underlying 67
posits 4
tossed 41
possible 714
reality 628
provides 195
objective 53
identify 83
exact 138
occurrences 17
paying 124
flashbacks 164
factual 35
convincingly 54
contradict 15
assertion 6
subjectivity 2
willing 209
lack 800
objectivity 8
question 389
patience 53
apparently 722
forth 141
slightest 80
whatsoever 306
faulted 5
impatience 3
insult 192
persistence 6
spells 17
itself 1110
effectively 108
yes 998
require 58
significant 92
amount 347
pieces 299
fit 360
create 345
separated 40
skillfully 13
purpose 337
providing 75
magnificent 143
cerebral 20
exercise 113
bestows 3
ultimate 141
satisfaction 32
awe 42
misunderstand 9
incomplete 31
puzzle 52
spider 46
blue 306
donnie 32
darko 19
ironic 95
masterfully 16
considering 390
quintessential 14
deus 16
ex 95
machina 16
cliché 279
dropped 93
ashamed 133
mentioning 79
sentence 97
contrast 138
perplex 3
cite 10
crumbles 6
exposed 60
intellectual 100
criticizing 18
discernible 29
thru 46
application 11
intelligent 312
superficial 79
consecutive 6
threads 44
discussion 77
forum 16
carefully 80
reads 59
asserts 4
solution 60
stop 766
altogether 100
answers 92
damned 79
limit 48
needed 488
hide 139
impact 178
behind 746
devils 50
backbone 13
exorcist 72
eerie 58
terrifying 59
hurry 43
complex 220
beats 82
sweat 30
clever 359
flawless 53
detail 210
breathless 17
person 1072
pay 443
specially 37
price 176
ticket 63
favor 202
hehehe 2
chair 117
norwegian 22
harald 3
zwart 3
producer 276
cody 15
banks 32
mccools 12
cup 69
soccer 43
germany 130
couldnt 1238
laughing 413
ages 116
rumors 13
beating 75
suppose 345
month 80
rented 296
delicious 30
ghastly 40
rolethe 3
wellhandled 6
absolutely 1103
slightly 362
eeriethe 3
bored 412
slightesti 2
menacing 72
kairo 16
solid 241
overplayed 17
helped 210
exceed 10
expectations 257
expecting 395
reviews 546
frankly 205
reviewers 175
inspiring 66
uplifting 36
radio 236
judge 210
differences 62
cuba 30
gooding 13
jr 185
ed 388
harris 110
awards 122
junk 169
served 118
daily 101
basis 102
frequently 96
outstanding 176
allowing 77
lost 891
various 395
emotions 231
occasionally 212
depend 20
psyche 37
wish 631
produce 140
calibre 18
inspired 202
felt 973
dramas 87
widely 42
sometime 46
oscar 312
worthy 215
coach 135
harold 64
jones 308
teaching 74
spend 359
debra 30
winger 5
sarah 102
drew 83
field 200
coachs 5
practicing 14
tie 80
bang 52
suspects 59
frightened 41
bond 235
enjoys 50
participating 20
games 221
school 1205
joness 14
priority 9
sorts 108
priorities 7
accepting 32
relationships 199
michael 783
tollin 3
proud 124
serious 706
overlooked 48
average 500
butts 17
mentioned 342
nomination 39
rating 675
youll 896
sophistication 20
cynicism 27
sentimental 82
heroes 190
strength 132
integrity 55
mentally 106
retarded 144
contribute 33
hogwash 8
jocks 25
vulnerable 43
remembering 29
yours 35
nature 314
scenic 12
locations 192
orient 8
sporadically 8
energetic 36
franco 97
reach 153
damatos 6
efforts 199
staying 75
trashy 64
author 140
emmanuelle 25
arsan 4
smallish 6
annie 49
belle 36
oddball 21
sexual 402
situations 311
boyfriend 291
zombies 261
al 156
cliver 4
persuades 11
continue 213
practices 15
married 296
orso 3
maria 66
guerrini 2
drops 62
professor 137
simultaneously 52
promisingly 11
lines 1130
dialog 702
shambles 14
plotlessly 2
finale 145
emanuelle 22
cannibals 23
search 228
tribe 59
hopes 186
violence 690
silly 758
appreciation 57
cornball 17
logic 186
challenged 57
youth 162
catalyst 11
unite 18
carolina 24
handicap 7
james 578
credit 358
went 1104
fixture 6
overlook 42
failure 191
instrumental 7
passion 198
collecting 25
involved 725
knocks 27
protective 16
mascot 10
sunny 36
disposition 11
wins 110
acceptance 38
ounce 27
malice 7
body 627
owes 28
pair 169
essence 90
principled 3
possibility 86
amends 5
bothers 37
merkerson 18
actresses 199
alfre 5
woodard 6
principle 33
warm 90
anyones 64
tend 116
quick 225
puts 250
ideas 419
proper 156
reaffirms 3
belief 138
realism 164
screenwriter 122
incorporate 15
racism 143
line 1209
writers 483
inject 35
incidents 40
attempt 801
overboard 25
towns 54
races 52
live 826
harmoniously 2
nominated 113
caring 102
validation 2
hostility 9
engendered 7
handled 126
dignity 56
sean 162
penns 16
drooling 10
fool 118
sam 267
seriously 760
elsewhere 96
suspect 204
competitive 9
students 275
opening 662
hearts 91
fortunate 37
rang 12
gently 14
radios 8
loving 144
experience 692
focused 108
basic 336
filled 303
figuring 14
happens 814
youd 299
lasting 39
face 1022
doing 1129
mike 216
firstclass 6
birch 8
purports 12
marine 49
base 126
attempted 117
coverup 7
unacceptable 15
resulted 27
former 324
captain 232
lovers 174
relation 54
continued 73
stalk 12
fire 436
arm 133
broke 86
attacked 115
knife 88
service 145
pistol 28
civilian 17
prosecutor 9
ruled 20
killing 524
defense 67
marines 35
decided 504
murder 609
decorated 20
vietnam 119
commanding 23
enemies 74
motor 18
rejecting 7
advances 30
butch 16
considerable 68
freight 8
motivating 4
controlling 22
actions 226
principal 73
participants 24
capable 161
editor 97
obscure 84
happenings 24
frustrating 88
shifting 23
lucky 139
bear 127
worthwhile 154
captains 20
court 92
martial 196
trial 80
mans 234
attorney 33
verdict 34
pacifist 8
folded 5
avoided 62
champions 4
fair 345
internally 3
kipling 4
poem 26
tommy 155
atkins 13
wait 491
tide 14
alfred 72
hitchcock 189
argue 98
spine 32
tingling 4
peter 472
lorre 31
essentially 171
switzerland 21
marrakech 2
stewart 132
doris 40
son 760
suspicious 58
assassinate 13
stabbed 44
market 112
proceeds 72
stewarts 13
assassination 44
kidnapped 101
sonthe 2
dayin 2
straight 537
proved 128
carefree 13
edge 222
albert 85
hall 133
classicthe 3
slowpaced 17
compare 225
iti 18
incredible 281
bernard 45
herrmann 5
climax 240
fake 400
setting 394
location 266
shots 718
heard 759
mixed 159
laure 7
equally 233
dismayed 9
nonexistent 151
languid 8
settings 100
exotic 63
gorgeous 170
handsome 135
length 169
liability 7
according 199
filmed 555
kept 542
attraction 86
ineffective 25
ridiculous 797
silliest 14
soft 159
blonde 126
helicopter 80
pilot 170
crossdresser 4
flies 69
orgy 18
midair 11
filming 286
camera 1273
footage 538
edited 197
bimbo 27
piloting 5
loud 246
pleasuring 4
ugly 272
cool 766
drags 119
crawl 48
wives 45
threesome 19
hardly 383
registers 9
hot 462
sorta 23
rarely 192
three 1515
clothes 238
minor 249
complaint 50
skin 154
punch 108
complaints 39
queen 213
watchable 267
egypt 38
laura 123
gemser 13
gabriele 6
tinti 6
believes 142
antique 12
low 1045
budget 1291
unexceptional 2
besides 279
abroad 30
flaw 112
encounter 120
appreciate 308
argument 70
admit 410
jimmy 116
improves 10
material 518
scary 640
assassin 85
skeleton 84
thin 208
layer 25
stretched 42
cost 186
particularly 656
filmshe 4
weep 12
belts 8
que 11
sera 9
fullback 2
sing 159
song 628
sorry 693
polished 29
hollywoodesque 2
grittier 6
ambiance 13
lately 60
renting 160
blockbuster 126
reminder 25
terrific 201
mention 587
appreciator 2
buff 65
hitchcocks 80
thriller 497
starring 288
dorris 3
husband 558
vacation 120
spy 94
arrest 32
ransom 20
doubt 536
comeback 27
outshined 4
keeping 170
sit 566
budge 4
treasure 96
strangely 111
showtime 84
fluff 32
dialogue 1184
pompously 3
nonsensically 5
philosophical 43
extraneous 19
achieve 103
hypnotic 29
thoroughly 167
pleasant 102
philippines 13
seldom 47
guilty 139
laserdisc 9
healthy 49
frenzy 23
argued 20
rebecca 44
gained 39
ingenious 35
half 1368
preparing 32
ignore 111
clumsy 81
rear 34
projections 3
weakness 36
villain 367
miles 180
flat 400
undeveloped 27
luckily 85
reggie 15
hank 15
irritating 224
brilliantly 107
stage 332
singer 178
traveling 84
morroco 2
leisure 13
bump 25
sought 28
carry 231
antagonists 16
kidnap 36
travel 165
assasination 3
relief 159
addition 197
won 215
sara 65
reccomend 5
morocco 20
caught 395
espionage 23
assassinations 10
kidnapping 42
considered 289
dialogues 90
chilling 83
inclusion 37
stroke 43
treats 56
benjamin 20
storm 115
cloud 41
cantata 3
londons 11
royal 40
politician 20
tends 59
buried 84
prejudice 73
preconception 2
sings 76
arguably 45
fully 207
fledged 3
holding 131
subtly 44
structured 24
motif 24
popular 300
jo 27
mckenna 6
settle 47
raise 95
mutual 24
unhappy 43
teases 9
horsedrawn 4
carriage 36
louis 101
implying 8
jealous 71
asking 166
recurrent 2
responds 21
familiarity 14
gag 109
suggesting 28
latent 8
confinement 7
realise 80
insists 45
giving 534
cruel 148
illustrates 20
power 565
imbalance 4
control 298
subdue 3
reactions 64
professional 206
suppress 9
suppressed 10
singing 269
potency 3
demonstrated 27
ambrose 2
chapel 10
reign 34
trained 83
clarity 26
volume 46
blend 69
congregation 6
drudges 2
warning 202
lungs 11
embassy 15
locate 39
masculine 12
activity 40
counterproductive 4
church 194
whilst 185
else 1467
moves 321
succeed 94
depriving 2
police 675
potentially 79
useful 70
joined 56
succeeds 83
foreshadowing 18
engulf 5
mckennas 2
futures 8
ours 23
prepares 11
allow 219
central 237
feature 493
build 192
lengthy 43
wordless 7
committed 155
expression 119
visually 126
conversations 86
images 327
exquisite 25
tight 136
matched 33
frame 160
relate 157
environment 99
nearly 493
unbearable 76
audience 1439
witty 166
effective 237
stickinthemud 2
nonconformist 3
preceded 26
walk 325
gunpoint 9
benefiting 4
window 204
subtle 208
onscreen 79
sources 38
foregrounded 2
lowkey 28
banal 62
dry 128
wit 132
outshone 3
brenda 19
walks 153
sinister 93
smokes 24
cigarette 31
preps 3
stance 15
gangsters 77
moll 5
belying 4
exterior 37
maternal 4
towards 410
everyman 16
cynical 93
hypocritical 22
espoused 3
fascist 12
ideology 15
rope 47
voyeur 9
mistreated 6
obsessive 21
necrophiliac 3
vertigo 20
phenomenal 36
reaction 156
overdoes 6
emotionally 117
stakes 33
warming 25
testament 48
everyday 99
millions 110
train 417
treasury 3
lois 19
lane 120
report 76
masked 29
detach 3
armed 73
guards 74
attack 266
remaining 100
vicious 65
overpower 4
gun 411
superman 46
fast 472
nonstop 77
watches 83
shorts 111
similarity 25
plots 240
mad 373
scientist 271
hidden 164
threatening 79
metropolis 8
rays 30
mechanical 34
monsters 229
electric 75
earthquake 33
magnetic 11
telescope 6
refreshingly 12
shooting 322
bombing 36
center 137
travels 76
press 78
reporter 110
ingredients 50
robbery 80
featured 136
motion 242
roofs 6
steam 37
locomotive 4
engineer 31
switch 67
track 291
lovely 248
wouldnt 799
feats 6
involving 317
balancing 9
placement 22
ultimately 275
win 245
legally 17
downloaded 8
meticulously 8
astonishing 47
voyage 50
william 351
goldings 3
trilogy 112
chronicle 7
australia 104
youthful 29
aristocrat 19
edmund 23
talbot 27
benedict 12
aboard 57
aging 58
position 115
crew 522
hopeful 22
sharing 37
passage 39
bullying 10
jared 8
politically 83
radical 33
philosopher 10
neill 16
canny 7
worked 413
bottom 319
jamie 115
fleetingly 8
brush 16
joanne 29
page 127
ship 299
passes 65
degree 133
physical 207
historic 44
attwood 2
screenwriters 62
tony 135
leigh 64
jackson 167
ear 44
manners 24
stiff 93
etiquette 4
crafting 6
totally 1069
convincing 333
microcosm 5
napoleonic 4
shipboard 3
monotonous 30
round 153
seasickness 3
squalor 6
danger 125
entangled 10
miseries 2
fellow 174
passengers 79
experiences 120
delirious 6
whirl 4
lifes 34
hardships 15
sentiments 17
master 304
patrick 115
novels 118
discover 181
leagues 13
honey 34
shrunk 5
squeaks 4
muppetvision 2
beat 224
relives 2
aladdin 7
mermaid 17
kidfriendly 3
orlando 6
partner 144
effect 436
presentations 8
grown 131
wanted 1016
advice 212
wall 215
thisthe 7
belongs 97
precable 2
networks 28
eager 48
offer 258
alternative 78
wellmade 32
credible 112
kathleen 20
beller 15
letters 59
prank 19
blythe 17
danner 15
bellers 5
ellen 46
johns 35
dennis 153
quaid 68
earliest 26
cocky 20
competent 99
chiller 25
relevant 82
social 252
youngsters 27
rates 53
scale 138
woos 7
masterful 59
coupled 42
leisurely 10
tracking 47
rental 181
borders 20
arthouse 40
tien 3
sammo 3
villains 168
baddest 4
reversal 11
normally 181
moustache 17
goofy 148
teeth 142
unsavory 8
skilled 31
likable 223
choreography 53
jackie 135
chan 128
blacksmith 2
glimpsed 8
yuen 10
somewhere 325
tan 19
evolutionary 9
terminator 60
robocop 60
stan 96
winston 16
spfx 3
robotics 4
lab 86
explosion 75
brain 371
indestructible 15
robot 160
regains 10
consciousness 38
wreaks 7
communicate 42
terri 7
austin 67
tries 887
reconnect 9
breaking 122
defeat 60
boss 211
turn 892
humans 171
cyborgs 8
project 391
pays 63
homage 98
stood 79
cyborg 44
breaks 151
free 414
giant 334
frankenstein 112
suite 10
typically 87
canadian 140
sleazy 109
pam 50
grier 53
hired 129
cheap 773
scifi 561
ranks 71
carl 79
lehman 3
mcilwraith 2
blown 120
deliberate 35
chemical 23
transplanted 8
metal 100
suit 162
colleagues 37
wicked 92
alex 125
whyte 5
hateful 24
cox 38
embarks 10
allout 15
spree 42
nasty 227
mercenary 24
hunter 149
loathsome 13
divine 52
jeanclaude 16
lord 178
previously 128
helmed 15
slasher 283
psycho 146
visiting 54
hours 742
stages 38
plentiful 20
verve 11
maintains 27
zippy 4
ensuring 6
sizes 17
enjoyably 11
scifihorror 12
outing 53
paunchy 4
thesp 4
maury 2
chaykin 2
honors 6
disgusting 196
fat 261
creep 34
tasteless 67
fistfight 10
pregnant 109
lauren 42
winning 129
teri 18
winstons 5
nifty 30
fx 116
paul 343
thrilling 69
add 616
fanfare 8
status 116
lang 29
randolph 33
sturdy 11
dean 143
jagger 18
surprisingly 267
accomplished 70
veteran 129
chill 24
wills 13
slim 31
summerville 4
carradine 56
barton 12
maclane 2
zane 26
grey 42
laying 29
cable 167
humor 922
demille 19
stamp 33
recognition 70
deserved 168
double 197
construction 58
transcontinental 2
telegraph 14
dedication 23
thrown 332
sustains 9
fractured 19
ribs 11
outlaw 18
ready 215
changes 294
hires 33
easterner 2
loan 30
mgm 70
fox 164
jaggers 3
virginia 55
gilmore 22
satisfy 56
outlaws 15
garden 80
labor 39
troubles 46
timid 15
cook 58
victor 59
killian 8
briskly 6
remembered 138
impression 280
resonates 10
westerns 111
northwest 26
kenneth 31
roberts 155
reading 470
greys 6
novel 585
cases 79
resembles 88
biggest 390
departures 2
mysteries 47
includes 168
gang 357
winds 75
saving 216
plans 129
telegraphs 4
worry 115
bandits 24
expert 76
shoot 359
doeeyed 6
beaten 77
raped 96
rape 181
harassed 17
stranger 111
dating 64
anxious 25
laid 82
shrill 18
wringing 6
hands 431
dated 139
entrance 25
couples 88
discuss 55
amateur 153
photographer 64
notes 74
stuffed 44
locker 23
wisely 38
slew 17
mattsons 2
dad 233
exboyfriend 13
overly 151
friendly 69
photography 271
teacher 240
rapist 24
cover 502
destroying 41
regard 84
attacker 7
harassing 16
calls 230
nancy 47
secretly 44
sets 554
catch 252
stalking 40
tack 10
hokey 71
narration 115
victims 277
abandoned 128
jobs 106
faces 266
reviewed 40
lover 195
morning 171
attitudes 64
embarassing 8
explain 365
nowadays 94
warrants 8
issued 19
blah 146
virgin 70
addressed 36
technology 127
policing 2
reform 25
debate 46
gone 566
attackers 4
twenty 193
tacked 25
afterthought 21
god 817
characterization 83
filmwise 2
betsy 14
shame 504
reluctant 34
twothirds 9
relive 16
tab 4
escaping 35
heist 102
bank 137
vance 9
shaw 30
creighton 3
accident 204
regenerates 3
poles 7
omaha 6
salt 41
lake 137
harvard 23
blake 49
flirt 10
edwards 50
sue 49
chooses 45
haunts 14
jack 524
slade 2
cattle 27
disguised 40
difficulties 32
brave 94
idealistic 16
facing 49
exception 252
identity 122
os 4
conquerors 2
forgotten 223
unavailability 2
region 48
blessing 19
incongruous 15
considers 28
depicting 55
founding 7
uniquely 15
organization 36
release 485
beggars 11
produced 372
occasion 52
german 384
undertook 2
direct 227
foxs 21
frank 227
rancho 2
hawks 24
beautifully 197
boasted 10
headed 84
merely 222
cosmetic 3
billing 45
scotts 28
chased 69
posse 27
plain 439
mclane 4
gunfight 12
distinguished 37
crossfire 26
string 106
forgettable 168
comedies 224
fifties 45
culminating 23
success 358
tvs 29
marcus 25
welby 2
md 8
seventies 49
wire 39
reformed 13
marauding 4
devious 18
east 141
joins 46
affections 18
irritatingly 12
meager 21
sparkling 18
delighted 35
crib 4
extras 144
trailer 247
graphics 102
ugh 68
footnote 11
interestingly 56
associate 43
brown 171
dreams 174
midian 12
follow 435
visits 53
transformed 45
nightbreed 17
creature 281
bitten 39
theyre 916
canadians 14
accents 151
ol 52
eh 50
observed 22
substitute 32
jews 63
nazis 109
struggle 172
versus 60
objection 7
underground 140
ramshackle 12
dirty 191
settlements 2
decor 4
tad 50
introduce 59
repeat 113
blew 68
monster 742
tanked 8
nineties 17
horrific 99
fairy 55
bigotry 19
mystical 22
clive 37
barker 35
sucks 312
sequel 622
gripe 18
craig 52
sheffer 6
passable 81
benefited 16
alright 159
issue 197
bakula 5
barkers 18
illusions 8
evocative 23
rites 15
comments 500
period 419
captured 183
revolves 106
egregious 12
miscasting 18
quack 3
chosen 125
philanderer 2
risible 15
nada 11
subplots 104
bore 132
removed 91
entirety 43
affecting 32
surely 261
suggests 99
fundamental 28
padding 34
benign 5
deflated 8
permeates 8
experienced 140
television 541
results 143
hellraiser 54
stalled 4
inhabitants 34
misunderstood 31
staples 9
fable 11
regarding 117
inhumanity 6
evoking 7
sympathy 152
devil 138
tough 269
demonic 49
nigh 13
impossible 333
cue 61
pitchforks 3
holy 73
wrath 20
doubly 5
upsetting 20
parable 8
ethnic 49
supremacy 6
